CL254/assignment/HW 4 Q1/Part b with nu=1e-4/blt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0) (1 0 0) (3 0 0) (3 1 0) (1 1 0) (0 1 0)
    (0 0 0.1) (1 0 0.1) (3 0 0.1) (3 1 0.1) (1 1 0.1) (0 1 0.1)

);

blocks
(
    hex (0 1 4 5 6 7 10 11) (40 80 1) simpleGrading (1 2 1)
    hex (1 2 3 4 7 8 9 10) (80 80 1) simpleGrading (1 2 1)
);

edges
(
);

boundary
(
    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 11 10)
	    (3 4 10 9)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
        );
    }
    plate
    {
        type wall;
        faces
        (
            (1 2 8 7)
        );
    }
     left
    {
        type patch;
        faces
        (
            (0 6 11 5)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 3 9 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 4 1)
            (4 3 2 1)
	    (6 7 10 11)
	    (7 8 9 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
