CL254/assignment/HW 4 Q1/Part b with nu=1e-4/blt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       19000;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       19120;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       19160;
    }
    left
    {
        type            patch;
        nFaces          80;
        startFace       19240;
    }
    right
    {
        type            patch;
        nFaces          80;
        startFace       19320;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19400;
    }
)

// ************************************************************************* //
